
#include <STC32G.H>
#include <intrins.h>
#include <stdio.h>
#include <string.h>
#define MAIN_Fosc       12000000L   //定义主时钟

volatile unsigned  int timer_ms = 0;       // 毫秒计时器
void sysini()
{
	EAXFR = 1; 									// 使能访问 XFR
	CKCON = 0x00; 							// 设置外部数据总线速度为最快
	WTST = 0x00;								// 设置程序代码等待参数，等待时间为0个时钟，CPU执行程序速度最快

	P0M1 = 0x00;P0M0 = 0x00;		// 设置P0口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P1M1 = 0x00;P1M0 = 0x00;		// 设置P1口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P2M1 = 0x00;P2M0 = 0x00;		// 设置P2口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	P3M1 = 0x00;P3M0 = 0x00;		// 设置P3口为准双向口模式 //00：准双向口 01：推挽输出 10：高阻输入 11：开漏输出
	 // 串口引脚功能配置 (P3.6:Rx, P3.7:Tx)
    P3M1 |= 0x40;   // P3.6:开漏输出
    P3M0 |= 0x80;   // P3.7:推挽输出
}
/***********************
 * 定时器0初始化
 * 配置1ms定时中断
 ***********************/
void Timer0_Init(void) {
	AUXR &= 0x7F;			//定时器时钟12T模式
	TMOD &= 0xF0;			//设置定时器模式
	TL0 = 0x18;				//设置定时初始值
	TH0 = 0xFC;				//设置定时初始值
	TF0 = 0;				//清除TF0标志
	TR0 = 1;				//定时器0开始计时
	ET0 = 1;				//使能定时器0中断
}

/***********************
 * 定时器0中断服务函数
 * 每1ms更新毫秒计数器
 ***********************/
void Timer0_ISR() interrupt 1 {
    TH0 = 0xFC;                 // 重装高8位
    TL0 = 0x18;                 // 重装低8位
    timer_ms++;                 // 更新毫秒计数器
}

/***********************
 * 毫秒延时函数
 * 基于定时器0的毫秒计数器
 * 修复了溢出问题
 ***********************/
void delayms(unsigned  int ms) {
unsigned  int start = timer_ms; //start 是 局部变量，仅在 delayus() 函数的作用域内有效，且在初始化后 不再被修改
    while (timer_ms- start < ms); // 等待指定毫秒数

}